<a href="https://colab.research.google.com/github/jack-cao-623/python_learning/blob/main/dataframes_02_filtering.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas DataFrames Part 2 -- Filtering

## Use up less memory by changing data types
- pd.to_datetime(df['col])
  - not like df['col'].astype()

In [1]:
# libraries needed
import numpy as np
import pandas as pd

In [2]:
# get data
df = pd.read_csv('https://raw.githubusercontent.com/jack-cao-623/python_learning/main/pandas/employees.csv')

# examine
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [3]:
# data types and non-null counts
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [4]:
# number of rows and columns
df.shape

(1000, 8)

In [5]:
# convert Start Date column/Series to datetime
df['Start Date'] = pd.to_datetime(df['Start Date'])

In [6]:
# convert Last Login Time column/Series to datetime
df['Last Login Time'] = pd.to_datetime(df['Last Login Time'])
  # today's date before timestamp
  # TODO: how to remove this part

In [7]:
# convert Senior Management column/Series to bool
df['Senior Management'] = df['Senior Management'].astype('bool')

In [8]:
# convert Gender column/Series to category
df['Gender'] = df['Gender'].astype('category')

In [9]:
# convert Team column/Series to category
df['Team'] = df['Team'].astype('category')

In [10]:
# view memory usage and confirm data type conversions
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    category
dtypes: bool(1), category(2), datetime64[ns](2), float64(1), int64(1), object(1)
memory usage: 42.6+ KB

In [11]:
# in future sections, use this code to import data
df = pd.read_csv('https://raw.githubusercontent.com/jack-cao-623/python_learning/main/pandas/employees.csv', 
                 parse_dates = ['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category') 
df['Team'] = df['Team'].astype('category')

## Filter a DataFrame based on a condition

In [12]:
# load data and improve memory usage
df = pd.read_csv('https://raw.githubusercontent.com/jack-cao-623/python_learning/main/pandas/employees.csv', 
                 parse_dates = ['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category') 
df['Team'] = df['Team'].astype('category')

In [13]:
# only employees who are male
df[df['Gender'] == 'Male']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-12-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-12-23 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2022-12-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-12-23 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2022-12-23 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2022-12-23 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2022-12-23 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2022-12-23 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-12-23 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-12-23 18:24:00,129949,10.169,True,Sales

In [14]:
# only Finance employees
df[df['Team'] == 'Finance']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2022-12-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-12-23 13:00:00,138705,9.340,True,Finance
7,NaN,Female,2015-07-20,2022-12-23 10:43:00,45906,11.598,True,Finance
14,Kimberly,Female,1999-01-14,2022-12-23 07:13:00,41426,14.543,True,Finance
46,Bruce,Male,2009-11-28,2022-12-23 22:47:00,114796,6.796,False,Finance
...,...,...,...,...,...,...,...,...
907,Elizabeth,Female,1998-07-27,2022-12-23 11:12:00,137144,10.081,False,Finance
954,Joe,Male,1980-01-19,2022-12-23 16:06:00,119667,1.148,True,Finance
987,Gloria,Female,2014-12-08,2022-12-23 05:08:00,136709,10.331,True,Finance
992,Anthony,Male,2011-10-16,2022-12-23 08:35:00,112769,11.625,True,Finance
996,Phillip,Male,1984-01-31,2022-12-23 06:30:00,42392,19.675,False,Finance

In [15]:
# alternatively, save boolean series as its own variable
# do this if it gets unwiedly, i.e., lots of conditions

In [16]:
# Senior Managers only; this is already a bool
df[df['Senior Management']]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-12-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-12-23 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2022-12-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-12-23 16:47:00,101004,1.389,True,Client Services
6,Ruby,Female,1987-08-17,2022-12-23 16:20:00,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
991,Rose,Female,2002-08-25,2022-12-23 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2022-12-23 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2022-12-23 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2022-12-23 17:47:00,98874,4.479,True,Marketing
999,Albert,Male,2012-05-15,2022-12-23 18:24:00,129949,10.169,True,Sales

In [17]:
# above is equivalent to
df[df['Senior Management'] == True]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-12-23 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-12-23 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2022-12-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-12-23 16:47:00,101004,1.389,True,Client Services
6,Ruby,Female,1987-08-17,2022-12-23 16:20:00,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
991,Rose,Female,2002-08-25,2022-12-23 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2022-12-23 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2022-12-23 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2022-12-23 17:47:00,98874,4.479,True,Marketing
999,Albert,Male,2012-05-15,2022-12-23 18:24:00,129949,10.169,True,Sales

In [18]:
# non-marketing employees
df[df['Team'] != 'Marketing']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2022-12-23 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-12-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-12-23 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-12-23 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2022-12-23 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2022-12-23 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2022-12-23 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2022-12-23 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2022-12-23 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2022-12-23 18:24:00,129949,10.169,True,Sales

In [19]:
# employees whose salary is greater than 110k
df[df['Salary'] > 110_000]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2022-12-23 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-12-23 13:00:00,138705,9.340,True,Finance
5,Dennis,Male,1987-04-18,2022-12-23 01:35:00,115163,10.125,False,Legal
9,Frances,Female,2002-08-08,2022-12-23 06:51:00,139852,7.524,True,Business Development
12,Brandon,Male,1980-12-01,2022-12-23 01:08:00,112807,17.492,True,Human Resources
...,...,...,...,...,...,...,...,...
987,Gloria,Female,2014-12-08,2022-12-23 05:08:00,136709,10.331,True,Finance
991,Rose,Female,2002-08-25,2022-12-23 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2022-12-23 08:35:00,112769,11.625,True,Finance
995,Henry,NaN,2014-11-23,2022-12-23 06:09:00,132483,16.655,False,Distribution
999,Albert,Male,2012-05-15,2022-12-23 18:24:00,129949,10.169,True,Sales

In [20]:
# employees whose bonus percentage is less than 1.5
df[df['Bonus %'] < 1.5]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
4,Larry,Male,1998-01-24,2022-12-23 16:47:00,101004,1.389,True,Client Services
15,Lillian,Female,2016-06-05,2022-12-23 06:09:00,59414,1.256,False,Product
58,Theresa,Female,2010-04-11,2022-12-23 07:18:00,72670,1.481,True,Engineering
77,Charles,Male,2004-09-14,2022-12-23 20:13:00,107391,1.260,True,Marketing
175,Willie,Male,1998-02-17,2022-12-23 20:20:00,146651,1.451,True,Engineering
189,Clarence,Male,1998-05-02,2022-12-23 03:16:00,85700,1.215,False,Sales
217,Douglas,Male,1999-09-03,2022-12-23 16:00:00,83341,1.015,True,Client Services
273,Nicholas,Male,1994-04-12,2022-12-23 20:21:00,74669,1.113,True,Product
279,Ruby,Female,2000-11-08,2022-12-23 19:35:00,105946,1.139,False,Business Development
365,Gloria,NaN,1983-07-19,2022-12-23 01:57:00,140885,1.113,False,Human Resources
445,Chris,Male,2006-12-12,2022-12-23 01:57:00,71642,1.496,False,NaN
481,NaN,Female,2013-04-27,2022-12-23 06:40:00,93847,1.085,True,Business Development
527,Helen,NaN,1993-12-02,2022-12-23 13:42:00,45724,1.022,False,Product
570,Kelly,Female,1996-08-16,2022-12-23 03:09:00,41427,1.431,False,Product
578,Amanda,Female,1982-03-17,2022-12-23 23:46:00,107111,1.438,True,Product
579,Harold,Male,2010-10-18,2022-12-23 20:45:00,65673,1.187,True,Legal
617,Kathy,Female,2001-01-14,2022-12-23 05:11:00,45682,1.451,True,Marketing
618,Peter,Male,1992-11-24,2022-12-23 17:43:00,69297,1.268,False,Finance
638,Frances,Female,1996-11-12,2022-12-23 18:08:00,112467,1.433,False,Business Development
652,Willie,Male,2009-12-05,2022-12-23 05:39:00,141932,1.017,True,Engineering
708,Steve,Male,2002-01-11,2022-12-23 21:17:00,51821,1.197,True,Legal
732,Henry,Male,1986-05-12,2022-12-23 02:04:00,59943,1.432,False,Finance
734,NaN,Female,1994-12-18,2022-12-23 20:42:00,138807,1.400,True,Human Resources
746,Gloria,Female,2004-08-19,2022-12-23 10:31:00,46602,1.027,True,Business Development
912,Joe,Male,1998-12-08,2022-12-23 10:28:00,126120,1.020,False,NaN
929,Theresa,Female,2001-04-27,2022-12-23 21:17:00,75661,1.079,True,Legal
954,Joe,Male,1980-01-19,2022-12-23 16:06:00,119667,1.148,True,Finance
997,Russell,Male,2013-05-20,2022-12-23 12:39:00,96914,1.421,False,Product

In [21]:
# employees who started on or before Jan 1, 1985
df[df['Start Date'] <= '1985-01-01']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,1980-08-12,2022-12-23 09:01:00,63241,15.132,True,NaN
12,Brandon,Male,1980-12-01,2022-12-23 01:08:00,112807,17.492,True,Human Resources
18,Diana,Female,1981-10-23,2022-12-23 10:27:00,132940,19.082,False,Client Services
28,Terry,Male,1981-11-27,2022-12-23 18:30:00,124008,13.464,True,Client Services
37,Linda,Female,1981-10-19,2022-12-23 20:49:00,57427,9.557,True,Client Services
...,...,...,...,...,...,...,...,...
982,Rose,Female,1982-04-06,2022-12-23 10:43:00,91411,8.639,True,Human Resources
983,John,Male,1982-12-23,2022-12-23 22:35:00,146907,11.738,False,Engineering
985,Stephen,NaN,1983-07-10,2022-12-23 20:10:00,85668,1.909,False,Legal
986,Donna,Female,1982-11-26,2022-12-23 07:04:00,82871,17.999,False,Marketing
996,Phillip,Male,1984-01-31,2022-12-23 06:30:00,42392,19.675,False,Finance

## Filtering based on multiple conditions: &
- Make use of parentheses or store each condition as its own variable

In [22]:
# load data and improve memory usage
df = pd.read_csv('https://raw.githubusercontent.com/jack-cao-623/python_learning/main/pandas/employees.csv', 
                 parse_dates = ['Start Date', 'Last Login Time'])
df['Senior Management'] = df['Senior Management'].astype('bool')
df['Gender'] = df['Gender'].astype('category') 
df['Team'] = df['Team'].astype('category')

In [28]:
# Male Marketing employees
(
    df[
        (df['Gender'] == 'Male') & (df['Team'] == 'Marketing')       # Gender is Male and Team is Marketing; need parentheses; can also save as own variables, each boolean mask
    ]
)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-12-23 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2022-12-23 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2022-12-23 07:45:00,37598,7.757,True,Marketing
74,Thomas,Male,1995-06-04,2022-12-23 14:24:00,62096,17.029,False,Marketing
77,Charles,Male,2004-09-14,2022-12-23 20:13:00,107391,1.260,True,Marketing
101,Aaron,Male,2012-02-17,2022-12-23 10:20:00,61602,11.849,True,Marketing
104,John,Male,1989-12-23,2022-12-23 07:01:00,80740,19.305,False,Marketing
112,Willie,Male,2003-11-27,2022-12-23 06:21:00,64363,4.023,False,Marketing
119,Paul,Male,2008-06-03,2022-12-23 15:05:00,41054,12.299,False,Marketing
150,Sean,Male,1996-05-04,2022-12-23 20:59:00,135490,19.934,False,Marketing
187,Roger,Male,2004-11-19,2022-12-23 15:55:00,51430,6.460,False,Marketing
204,Willie,Male,2006-06-06,2022-12-23 09:45:00,55281,4.935,True,Marketing
216,Matthew,Male,2013-07-31,2022-12-23 08:04:00,142373,2.462,False,Marketing
252,Ralph,Male,2004-11-11,2022-12-23 01:35:00,71896,4.232,True,Marketing
274,Howard,Male,1982-10-05,2022-12-23 07:22:00,97490,5.460,True,Marketing
293,Jesse,Male,1999-10-25,2022-12-23 15:35:00,118733,9.653,False,Marketing
309,Benjamin,Male,1984-09-11,2022-12-23 06:37:00,84810,15.794,False,Marketing
327,Aaron,Male,1994-01-29,2022-12-23 18:48:00,58755,5.097,True,Marketing
353,NaN,Male,1997-04-22,2022-12-23 21:36:00,65078,3.095,True,Marketing
403,Craig,Male,1984-02-08,2022-12-23 04:45:00,113506,19.642,False,Marketing
413,Johnny,Male,1992-09-14,2022-12-23 08:21:00,115194,5.861,True,Marketing
452,Scott,Male,2012-11-17,2022-12-23 14:47:00,146812,1.965,True,Marketing
454,NaN,Male,1995-02-21,2022-12-23 00:26:00,136602,10.429,True,Marketing
461,Jeremy,Male,2001-08-09,2022-12-23 03:56:00,43354,13.946,False,Marketing
464,Lawrence,Male,2005-05-13,2022-12-23 01:25:00,74640,18.641,False,Marketing
484,Joe,Male,2000-04-14,2022-12-23 15:14:00,50645,11.119,False,Marketing
496,Johnny,Male,2016-02-26,2022-12-23 19:39:00,76394,5.437,True,Marketing
503,Roger,Male,2015-08-03,2022-12-23 16:56:00,125033,4.887,True,Marketing
544,Roger,Male,2010-07-03,2022-12-23 17:11:00,105689,13.320,True,Marketing
550,Gregory,Male,1984-06-18,2022-12-23 03:46:00,82726,16.304,True,Marketing
556,Arthur,Male,2014-12-16,2022-12-23 16:56:00,66819,6.639,True,Marketing
571,Jonathan,Male,1995-04-06,2022-12-23 22:38:00,56993,18.623,False,Marketing
581,Ernest,Male,1990-01-28,2022-12-23 00:08:00,81919,15.118,False,Marketing
696,Samuel,Male,2012-05-25,2022-12-23 16:40:00,85550,11.593,True,Marketing
722,Joshua,Male,1997-06-27,2022-12-23 15:23:00,95003,5.197,True,Marketing
798,Lawrence,Male,1984-10-01,2022-12-23 14:06:00,102589,17.952,True,Marketing
860,Phillip,Male,1984-10-07,2022-12-23 11:05:00,36837,14.660,False,Marketing
867,Earl,Male,2013-06-15,2022-12-23 03:00:00,48046,7.737,False,Marketing
899,Walter,Male,1992-05-21,2022-12-23 00:39:00,144701,16.323,True,Marketing
947,NaN,Male,2012-07-30,2022-12-23 15:07:00,107351,5.329,True,Marketing
994,George,Male,2013-06-21,2022-12-23 17:47:00,98874,4.479,True,Marketing

## Filtering based on multiple conditions: |
- vertical pipe/line | means "or"